/* Фиктивные данные о заметках для отладки */

const notes = [
    {
        date: new Date(2025, 2, 8),
        color: 'beige',
        title: 'Какой-то странный текст', 
        content: 'Lorem ipsum abrakadabra laboka delakoka the parriot merai abrakadabra barbos nasos vizon bizon kalakalakamazon'
    },
    {
        date: new Date(2025, 1, 24),
        color: 'red',
        title: 'Великий стих', 
        content: 'Я тракторист, тили-тили рист. Клара украла у Карла кораллы, Карл украл у Клары кларнет. Что за жизнь такая, все друг у друга воруют!'
    },
    {
        date: new Date(2024, 9, 7),
        color: 'blue',
        title: 'About Me', 
        content: 'Абаут ми. Ну что тут можно сказать.. Я - великий программист на реакт с опытом пару недель :) А ещё я умею делать выход с переворотом на турнике и верю, что истинная сила человека измеряется в количестве выходов силой, которые он может сделать.'
    },
    {
        date: new Date(2024, 5, 14),
        color: 'green',
        title: 'Как сделать омлет', 
        content: 'Подготовьте ингредиенты. Яйца заранее извлеките из холодильника, чтобы они прогрелись и были комнатной температуры. Тогда омлет лучше взобьётся и будет пышным.\n2. Вбейте куриные яйца в глубокую ёмкость, влейте молоко любой жирности или замените его обычной водой, если у вас непереносимость лактозы. Посолите и поперчите. \n2. Взбейте яйца с помощью венчика или вилки примерно 2–3 минуты. Дольше взбивать не имеет смысла, так как важно лишь тщательно перемешать белки с желтками, а не создавать воздушные пузырьки. \n 3. Разогрейте сковороду с растительным маслом. Аккуратно влейте на неё яичную массу и убавьте нагрев до минимального. \n 4. Накройте сковороду крышкой и жарьте омлет примерно 5–6 минут на минимальном нагреве. \n 5. Выложите румяный омлет на тарелку и подайте к столу горячим вместе с овощной нарезкой, салатами, колбасой или паштетом.'
    },
    {
        date: new Date(2025, 0, 31),
        color: 'violet',
        title: 'Моё путешествие в глубины космоса и пыли', 
        content: 'Вчера я решил попробовать некое вещество, которое дал мне алхимик. Боже, это было невероятно. Таких сильных глюков я ещё никогда в жизни не видел! Я тракторист, тили-тили рист. Клара украла у Карла кораллы, Карл украл у Клары кларнет. Что за жизнь такая, все друг у друга воруют!'
    },
    {
        date: new Date(2025, 10, 9),
        color: 'dark-blue',
        title: 'Какой-то странный текст', 
        content: 'Lorem ipsum abrakadabra laboka delakoka the parriot merai abrakadabra barbos nasos vizon bizon kalakalakamazon'
    },
    {
        date: new Date(2024, 6, 19),
        color: 'red',
        title: 'Как сделать омлет', 
        content: 'Подготовьте ингредиенты. Яйца заранее извлеките из холодильника, чтобы они прогрелись и были комнатной температуры. Тогда омлет лучше взобьётся и будет пышным.\n2. Вбейте куриные яйца в глубокую ёмкость, влейте молоко любой жирности или замените его обычной водой, если у вас непереносимость лактозы. Посолите и поперчите. \n2. Взбейте яйца с помощью венчика или вилки примерно 2–3 минуты. Дольше взбивать не имеет смысла, так как важно лишь тщательно перемешать белки с желтками, а не создавать воздушные пузырьки. \n 3. Разогрейте сковороду с растительным маслом. Аккуратно влейте на неё яичную массу и убавьте нагрев до минимального. \n 4. Накройте сковороду крышкой и жарьте омлет примерно 5–6 минут на минимальном нагреве. \n 5. Выложите румяный омлет на тарелку и подайте к столу горячим вместе с овощной нарезкой, салатами, колбасой или паштетом.'
    },
    {
        date: new Date(2025, 4, 1),
        color: 'blue',
        title: 'Великий стих', 
        content: 'Я тракторист, тили-тили рист. Клара украла у Карла кораллы, Карл украл у Клары кларнет. Что за жизнь такая, все друг у друга воруют!'
    },
    {
        date: new Date(2025, 0, 31),
        color: 'green',
        title: 'Моё путешествие в глубины космоса и пыли', 
        content: 'Вчера я решил попробовать некое вещество, которое дал мне алхимик. Боже, это было невероятно. Таких сильных глюков я ещё никогда в жизни не видел! Я тракторист, тили-тили рист. Клара украла у Карла кораллы, Карл украл у Клары кларнет. Что за жизнь такая, все друг у друга воруют!'
    },
];


export default notes;